-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-03-24 08:22:25
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.4.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `cych`
--

-- --------------------------------------------------------

--
-- 資料表結構 `foodbk`
--

CREATE TABLE `foodbk` (
  `foodname` varchar(100) NOT NULL,
  `foodtype` varchar(100) NOT NULL,
  `foodunit` float NOT NULL,
  `subtype` varchar(40) NOT NULL,
  `weight` int(4) NOT NULL,
  `calorie` int(4) NOT NULL,
  `carbohydrate` int(4) NOT NULL,
  `protein` int(4) NOT NULL,
  `fat` int(4) NOT NULL,
  `Ca` int(4) NOT NULL,
  `Fe` int(4) NOT NULL,
  `P` int(4) NOT NULL,
  `K` int(4) NOT NULL,
  `fiber` int(4) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `foodbk`
--

INSERT INTO `foodbk` (`foodname`, `foodtype`, `foodunit`, `subtype`, `weight`, `calorie`, `carbohydrate`, `protein`, `fat`, `Ca`, `Fe`, `P`, `K`, `fiber`) VALUES
('全脂奶', '乳品類', 1, '(240c.c/杯)', 240, 150, 12, 8, 8, 240, 0, 199, 353, 0),
('全脂奶粉', '乳品類', 4, '湯匙', 30, 150, 12, 8, 8, 274, 0, 207, 349, 0),
('起司片', '乳品類', 2, '片', 45, 150, 3, 8, 8, 273, 0, 194, 32, 0),
('低脂奶 ', '乳品類', 1, '杯(240c.c/杯)', 240, 120, 12, 8, 4, 235, 1, 189, 329, 0),
('低脂奶粉', '乳品類', 3, '湯匙', 25, 120, 12, 8, 4, 240, 0, 185, 311, 0),
('優格(無糖)', '乳品類', 0.75, '杯(210c.c/杯)', 210, 120, 12, 8, 4, 216, 0, 191, 365, 0),
('優酪乳(無糖)', '乳品類', 1, '杯(240c.c/杯)', 240, 120, 12, 8, 4, 216, 0, 180, 415, 0),
('脫脂奶 ', '乳品類', 1, '杯(240c.c/杯)', 240, 80, 12, 8, 0, 242, 0, 173, 322, 0),
('脫脂奶粉', '乳品類', 2.5, '湯匙', 20, 80, 12, 8, 0, 281, 0, 208, 352, 0),
('無糖豆漿', '豆魚蛋肉類(低脂)', 1, '杯紙杯(190c.c/杯)', 190, 55, 0, 7, 3, 27, 1, 129, 268, 2),
('雞蛋', '豆魚蛋肉類(中脂)', 1, '顆', 55, 75, 0, 7, 5, 24, 1, 102, 75, 0),
('五香豆干', '豆魚蛋肉類(中脂)', 1, '片', 35, 75, 0, 7, 5, 96, 2, 102, 88, 0),
('小方豆干', '豆魚蛋肉類(中脂)', 1, '片', 40, 75, 0, 7, 5, 274, 2, 99, 66, 0),
('傳統豆腐', '豆魚蛋肉類(中脂)', 1, '格', 80, 75, 0, 7, 5, 112, 2, 89, 144, 0),
('嫩豆腐', '豆魚蛋肉類(中脂)', 0.5, '盒', 140, 75, 0, 7, 5, 18, 2, 102, 231, 0),
('虱目魚', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 6, 0, 70, 123, 0),
('肉鯽魚', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 6, 0, 67, 116, 0),
('鮭魚', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 2, 0, 79, 117, 0),
('鱈魚', '豆魚蛋肉類(中脂)', 1, '個三指寬', 50, 75, 0, 7, 5, 9, 0, 83, 143, 0),
('排骨(豬大排)', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 0, 0, 0, 0, 0),
('豬小排', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 0, 0, 0, 0, 0),
('豬後腿肉', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 1, 0, 67, 110, 0),
('豬前腿肉', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 1, 0, 58, 95, 0),
('羊肉', '豆魚蛋肉類(中脂)', 1, '個三指寬', 30, 75, 0, 7, 5, 3, 1, 60, 98, 0),
('秋刀魚', '豆魚蛋肉類(高脂)', 1, '個三指寬', 35, 125, 0, 7, 10, 4, 0, 64, 83, 0),
('五穀飯', '全榖雜糧類', 0.25, '碗', 40, 70, 15, 2, 0, 4, 0, 69, 52, 1),
('糙米飯', '全榖雜糧類', 0.25, '碗', 40, 70, 15, 2, 0, 2, 0, 52, 44, 1),
('粥', '全榖雜糧類', 0.5, '碗', 125, 70, 15, 2, 0, 0, 0, 16, 16, 0),
('蘿蔔糕', '全榖雜糧類', 1, '塊', 50, 70, 15, 2, 0, 3, 4, 14, 16, 0),
('麥片', '全榖雜糧類', 3, '湯匙', 20, 70, 15, 2, 0, 8, 0, 23, 66, 1),
('饅頭', '全榖雜糧類', 0.3, '個(中)', 30, 70, 15, 2, 0, 6, 0, 17, 20, 0),
('吐司', '全榖雜糧類', 1, '片', 30, 70, 15, 2, 0, 8, 0, 30, 30, 1),
('麵條', '全榖雜糧類', 0.5, '碗', 60, 70, 15, 2, 0, 3, 0, 47, 75, 1),
('青菜', '蔬菜類', 0.5, '碗', 25, 25, 5, 1, 0, 0, 0, 0, 0, 2),
('一般沙拉油', '油脂與堅果種子類', 1, '茶匙', 5, 45, 0, 0, 5, 0, 0, 0, 0, 0),
('橄欖油', '油脂與堅果種子類', 1, '茶匙', 5, 45, 0, 0, 5, 0, 0, 0, 0, 0),
('芥花油', '油脂與堅果種子類', 1, '茶匙', 5, 45, 0, 0, 5, 0, 0, 0, 0, 0),
('鮪魚', '豆魚蛋肉類(低脂)', 0.5, '掌心', 30, 55, 0, 7, 3, 1, 1, 69, 153, 0),
('一般魚', '豆魚蛋肉類(低脂)', 0.5, '掌心', 35, 55, 0, 7, 3, 0, 0, 0, 0, 0),
('豬排(豬大里肌)', '豆魚蛋肉類(低脂)', 0.5, '掌心', 30, 55, 0, 7, 3, 1, 0, 38, 102, 0),
('牛腱', '豆魚蛋肉類(低脂)', 0.5, '掌心', 35, 55, 0, 7, 3, 3, 1, 64, 104, 0),
('雞胸肉', '豆魚蛋肉類(低脂)', 0.5, '掌心', 30, 55, 0, 7, 3, 0, 0, 67, 93, 0),
('麵條', '全榖雜糧類', 0.5, '碗', 60, 70, 15, 2, 0, 3, 0, 47, 75, 1),
('雞腿', '豆魚蛋肉類(低脂)', 0.5, '隻', 40, 55, 0, 7, 3, 2, 0, 60, 98, 0),
('飯', '全榖雜糧類', 0.25, '碗', 40, 70, 15, 2, 0, 0, 0, 16, 16, 0);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
